blog/2016-08-26-bash脚本编程.org
#+TITLE: Bash脚本编程
#+DATE: 2016-05-22
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Bash
#+JEKYLL_TAGS: Linux Bash 编程语言
#+JEKYLL_PUBLISHED: true


* 弱类型与强类型
- 强类型: 定义变量时必须指定类型、参与运算必须符合类型要求；调用未声明变量会产生错误
- 弱类型: 无须指定类型，默认均为字符型；参与运算会自动进行隐式类型转换；变量无须事先定义可直接调用
- bash是一种弱类型语言，把所有要存储的数据都当作字符进行，同时不支持浮点数
* Shell脚本的执行
- Shell编程: 过程式、解释执行
- 脚本文件要直接运行需要添加 =x= 权限，或直接运行解释器进行执行
* 检查和调试脚本
#+BEGIN_SRC yaml
bash -n SCRIPT  # 检测脚本中的语法错误
bash -x SCRIPT  # 调试执行脚本
  # 行头+代表层数
#+END_SRC

* shebang
- shebang是脚本文件第一行(=#!/bin/bash=)，用于指明执行脚本的解释器，
- 内核通过文件前几个字节的魔数(magic number)来识别文件执行类型然后打开
* 脚本状态码
#+BEGIN_SRC bash
exit [n]  # 终止脚本，退出码为n(默认为0)
#+END_SRC
- 如果未给脚本指定退出状态码，整个脚本的退出状态码取决于脚本中执行的最后一条命令的状态码
* 用户交互
#+BEGIN_SRC yaml
read [option]... [name ...] 
  -p 'PROMPT': 显示交互信息
  -t TIMEOUT: 等待时间

  name ...: read会对输入的字符串以空格进行分隔来对位赋值，剩余部分会赋给最后一个参数
#+END_SRC
* 选择执行语句
- if ::
  #+BEGIN_SRC bash
  if COMMAND1
  then
      # COMMAND1成功后执行的代码
  elif COMMAND2; then  # 可以写在一行
      # COMMAND1失败且COMMAND2成功后执行的代码
  else
      # COMMAND1和COMMAND2都失败后执行的代码
  fi  # if结束标志
  #+END_SRC
- case ::
  #+BEGIN_SRC bash
  case 变量引用 in
  glob1)  # 可使用 glob 风格通配符
      分支1
      ;;  # 终止符
  glob2|glob3)  # 使用|来匹配多个glob
      分支2
      ;;
  ...
  *)
      默认分支
      ;;
  esac
  #+END_SRC
  - case语句只执行第一次成功匹配的分支
* 循环执行语句
- for ::
  - 列表式
    #+BEGIN_SRC bash
    for 变量名 in 列表; do
        循环体
    done
    # 依次将列表中的元素赋值给"变量名"; 每次赋值后即执行一次循环体; 直到列表中的元素耗尽，循环结束
    #+END_SRC
    #+BEGIN_EXAMPLE
    列表生成方式
      1. 直接给出列表
      2. 整数列表
        1. {start..end}
        2. $(seq [start [step]] end) 
      3. 返回列表的命令
      4. 文件名通配glob, 会展开文件名列表
      5. 变量引用, 例如$@、$*
    #+END_EXAMPLE
  - C风格式
    #+BEGIN_SRC bash
    for ((控制变量初始化;条件判断表达式;控制变量的修正表达式)); do
        循环体
    done
    #+END_SRC
    - 控制变量初始化：仅在运行到循环代码段时执行一次
    - 控制变量的修正表达式：每轮循环结束会先进行控制变量修正运算，而后再做条件判断

- while ::
  #+BEGIN_SRC bash
  while COMMAND; do  # 当COMMAND为真的时候, 重复执行循环体直至COMMAND为假
      循环体
  done
  #+END_SRC
  #+BEGIN_SRC bash
  while read line; do  # 特殊用法: 遍历文件的每一行
      循环体
  done < FILE
  #+END_SRC

- until :: 
  #+BEGIN_SRC bash
  until COMMAND; do  # 当COMMAND为假的时候, 重复执行循环体直至COMMAND为真
      循环体
  done
  #+END_SRC
- 循环控制语句 ::
  - =continue [N]=: 提前结束第N层的本轮循环，直接进入下一轮判断
  - =break [N]=: 提前结束第N层的循环
    - 在死循环(=while true=)中使用break来控制循环
* 函数
- 函数有两种风格的写法，同时函数只有被调用才会执行
#+BEGIN_SRC bash
function f_name {
    ...
    echo $result  # 用于作为函数的输出值
    return 0  # 用于返回函数退出状态码，若省略则返回最后一个命令的结果，范围是0-255
}
#+END_SRC
#+BEGIN_SRC bash
f_name() {
    ...
}
#+END_SRC
- 函数的返回值
  - 函数的输出值: 通过echo或print进行输出来作为函数输出值，可以通过使用命令引用来取得
  - 函数退出状态码：通过return或最后一条命令的退出状态码，通过 =$?= 取得
- 在函数中，可以像脚本传递参数那样使用其参数，因此不可使用外边脚本的特殊参数

* bash变量
