_posts/2016-08-26-bash脚本编程.html
---
title: "Bash脚本编程"
date: 2016-05-22
layout: post
categories: 
- Bash
tags: 
- Linux 
- Bash 
- 编程语言
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 弱类型与强类型</a></li>
<li><a href="#orgheadline2">2. Shell脚本的执行</a></li>
<li><a href="#orgheadline3">3. 检查和调试脚本</a></li>
<li><a href="#orgheadline4">4. shebang</a></li>
<li><a href="#orgheadline5">5. 脚本状态码</a></li>
<li><a href="#orgheadline6">6. 用户交互</a></li>
<li><a href="#orgheadline7">7. 选择执行语句</a></li>
<li><a href="#orgheadline8">8. 循环执行语句</a></li>
<li><a href="#orgheadline9">9. 函数</a></li>
<li><a href="#orgheadline19">10. bash变量</a>
<ul>
<li><a href="#orgheadline10">变量的类型与生效范围</a></li>
<li><a href="#orgheadline15">本地与环境变量</a>
<ul>
<li><a href="#orgheadline11">变量的赋值</a></li>
<li><a href="#orgheadline12">变量的引用</a></li>
<li><a href="#orgheadline13">变量的查询</a></li>
<li><a href="#orgheadline14">变量的删除</a></li>
</ul>
</li>
<li><a href="#orgheadline16">局部变量</a></li>
<li><a href="#orgheadline17">只读变量</a></li>
<li><a href="#orgheadline18">位置变量</a></li>
</ul>
</li>
<li><a href="#orgheadline24">11. bash数组</a>
<ul>
<li><a href="#orgheadline20">引用数组</a></li>
<li><a href="#orgheadline21">声明数组</a></li>
<li><a href="#orgheadline22">数组元素的赋值</a></li>
<li><a href="#orgheadline23">读取数组的长度</a></li>
</ul>
</li>
<li><a href="#orgheadline30">12. bash字符串处理</a>
<ul>
<li><a href="#orgheadline25">子符串切片</a></li>
<li><a href="#orgheadline26">基于glob取子串</a></li>
<li><a href="#orgheadline27">查找替换(最长匹配)</a></li>
<li><a href="#orgheadline28">大小写转换</a></li>
<li><a href="#orgheadline29">变量赋值</a></li>
</ul>
</li>
<li><a href="#orgheadline33">13. bash中的算术计算</a>
<ul>
<li><a href="#orgheadline31">计算命令</a></li>
<li><a href="#orgheadline32">运算符号</a></li>
</ul>
</li>
<li><a href="#orgheadline40">14. bash的条件测试</a>
<ul>
<li><a href="#orgheadline34">测试命令</a></li>
<li><a href="#orgheadline38">测试符号</a>
<ul>
<li><a href="#orgheadline35">数值测试</a></li>
<li><a href="#orgheadline36">字符串测试</a></li>
<li><a href="#orgheadline37">文件测试</a></li>
</ul>
</li>
<li><a href="#orgheadline39">组合条件</a></li>
</ul>
</li>
<li><a href="#orgheadline41">15. bash输出的字体颜色</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 弱类型与强类型</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>强类型: 定义变量时必须指定类型、参与运算必须符合类型要求；调用未声明变量会产生错误</li>
<li>弱类型: 无须指定类型，默认均为字符型；参与运算会自动进行隐式类型转换；变量无须事先定义可直接调用</li>
<li>bash是一种弱类型语言，把所有要存储的数据都当作字符进行，同时不支持浮点数</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Shell脚本的执行</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Shell编程: 过程式、解释执行</li>
<li>脚本文件要直接运行需要添加 <code>x</code> 权限，或直接运行解释器进行执行</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 检查和调试脚本</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-yaml">bash -n SCRIPT  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26816;&#27979;&#33050;&#26412;&#20013;&#30340;&#35821;&#27861;&#38169;&#35823;</span>
bash -x SCRIPT  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35843;&#35797;&#25191;&#34892;&#33050;&#26412;</span>
  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#34892;&#22836;+&#20195;&#34920;&#23618;&#25968;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> shebang</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>shebang是脚本文件第一行(<code>#!/bin/bash</code>)，用于指明执行脚本的解释器，</li>
<li>内核通过文件前几个字节的魔数(magic number)来识别文件执行类型然后打开</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> 脚本状态码</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">exit</span> <span style="color: #AE81FF;">[</span>n<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32456;&#27490;&#33050;&#26412;&#65292;&#36864;&#20986;&#30721;&#20026;n(&#40664;&#35748;&#20026;0)</span>
</pre>
</div>
<ul class="org-ul">
<li>如果未给脚本指定退出状态码，整个脚本的退出状态码取决于脚本中执行的最后一条命令的状态码</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> 用户交互</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-yaml">read [option]... [name ...] 
  -p <span style="color: #E6DB74;">'PROMPT'</span>: &#26174;&#31034;&#20132;&#20114;&#20449;&#24687;
  <span style="color: #FD971F;">-t TIMEOUT</span>: &#31561;&#24453;&#26102;&#38388;

  <span style="color: #FD971F;">name ...</span>: read&#20250;&#23545;&#36755;&#20837;&#30340;&#23383;&#31526;&#20018;&#20197;&#31354;&#26684;&#36827;&#34892;&#20998;&#38548;&#26469;&#23545;&#20301;&#36171;&#20540;&#65292;&#21097;&#20313;&#37096;&#20998;&#20250;&#36171;&#32473;&#26368;&#21518;&#19968;&#20010;&#21442;&#25968;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> 选择执行语句</h2>
<div class="outline-text-2" id="text-7">
<dl class="org-dl">
<dt>if</dt><dd><div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">if</span> COMMAND1
<span style="color: #F92672;">then</span>
    <span style="color: #75715E;"># </span><span style="color: #75715E;">COMMAND1&#25104;&#21151;&#21518;&#25191;&#34892;&#30340;&#20195;&#30721;</span>
<span style="color: #F92672;">elif</span> COMMAND2; <span style="color: #F92672;">then</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21487;&#20197;&#20889;&#22312;&#19968;&#34892;</span>
    <span style="color: #75715E;"># </span><span style="color: #75715E;">COMMAND1&#22833;&#36133;&#19988;COMMAND2&#25104;&#21151;&#21518;&#25191;&#34892;&#30340;&#20195;&#30721;</span>
<span style="color: #F92672;">else</span>
    <span style="color: #75715E;"># </span><span style="color: #75715E;">COMMAND1&#21644;COMMAND2&#37117;&#22833;&#36133;&#21518;&#25191;&#34892;&#30340;&#20195;&#30721;</span>
<span style="color: #F92672;">fi</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">if&#32467;&#26463;&#26631;&#24535;</span>
</pre>
</div></dd>
<dt>case</dt><dd><div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">case</span> &#21464;&#37327;&#24341;&#29992;<span style="color: #F92672;"> in</span>
glob1)  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21487;&#20351;&#29992; glob &#39118;&#26684;&#36890;&#37197;&#31526;</span>
    &#20998;&#25903;1
    ;;  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32456;&#27490;&#31526;</span>
glob2|glob3)  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;|&#26469;&#21305;&#37197;&#22810;&#20010;glob</span>
    &#20998;&#25903;2
    ;;
...
*<span style="color: #F8F8F2; background-color: #272822;">)</span>
    &#40664;&#35748;&#20998;&#25903;
    ;;
<span style="color: #F92672;">esac</span>
</pre>
</div>
<ul class="org-ul">
<li>case语句只执行第一次成功匹配的分支</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> 循环执行语句</h2>
<div class="outline-text-2" id="text-8">
<dl class="org-dl">
<dt>for</dt><dd><ul class="org-ul">
<li><p>
列表式
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">for</span> &#21464;&#37327;&#21517;<span style="color: #F92672;"> in</span> &#21015;&#34920;; <span style="color: #F92672;">do</span>
    &#24490;&#29615;&#20307;
<span style="color: #F92672;">done</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#20381;&#27425;&#23558;&#21015;&#34920;&#20013;&#30340;&#20803;&#32032;&#36171;&#20540;&#32473;"&#21464;&#37327;&#21517;"; &#27599;&#27425;&#36171;&#20540;&#21518;&#21363;&#25191;&#34892;&#19968;&#27425;&#24490;&#29615;&#20307;; &#30452;&#21040;&#21015;&#34920;&#20013;&#30340;&#20803;&#32032;&#32791;&#23613;&#65292;&#24490;&#29615;&#32467;&#26463;</span>
</pre>
</div>
<pre class="example">
列表生成方式
  1. 直接给出列表
  2. 整数列表
    1. {start..end}
    2. $(seq [start [step]] end) 
  3. 返回列表的命令
  4. 文件名通配glob, 会展开文件名列表
  5. 变量引用, 例如$@、$*
</pre></li>
<li><p>
C风格式
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">for</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>&#25511;&#21046;&#21464;&#37327;&#21021;&#22987;&#21270;;&#26465;&#20214;&#21028;&#26029;&#34920;&#36798;&#24335;;&#25511;&#21046;&#21464;&#37327;&#30340;&#20462;&#27491;&#34920;&#36798;&#24335;<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>; <span style="color: #F92672;">do</span>
    &#24490;&#29615;&#20307;
<span style="color: #F92672;">done</span>
</pre>
</div>
<ul class="org-ul">
<li>控制变量初始化：仅在运行到循环代码段时执行一次</li>
<li>控制变量的修正表达式：每轮循环结束会先进行控制变量修正运算，而后再做条件判断</li>
</ul></li>
</ul></dd>

<dt>while</dt><dd><div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">while</span> COMMAND; <span style="color: #F92672;">do</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#24403;COMMAND&#20026;&#30495;&#30340;&#26102;&#20505;, &#37325;&#22797;&#25191;&#34892;&#24490;&#29615;&#20307;&#30452;&#33267;COMMAND&#20026;&#20551;</span>
    &#24490;&#29615;&#20307;
<span style="color: #F92672;">done</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">while </span><span style="color: #F92672;">read</span> line; <span style="color: #F92672;">do</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29305;&#27530;&#29992;&#27861;: &#36941;&#21382;&#25991;&#20214;&#30340;&#27599;&#19968;&#34892;</span>
    &#24490;&#29615;&#20307;
<span style="color: #F92672;">done</span> &lt; FILE
</pre>
</div></dd>

<dt>until</dt><dd><div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">until</span> COMMAND; <span style="color: #F92672;">do</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#24403;COMMAND&#20026;&#20551;&#30340;&#26102;&#20505;, &#37325;&#22797;&#25191;&#34892;&#24490;&#29615;&#20307;&#30452;&#33267;COMMAND&#20026;&#30495;</span>
    &#24490;&#29615;&#20307;
<span style="color: #F92672;">done</span>
</pre>
</div></dd>
<dt>循环控制语句</dt><dd><ul class="org-ul">
<li><code>continue [N]</code>: 提前结束第N层的本轮循环，直接进入下一轮判断</li>
<li><code>break [N]</code>: 提前结束第N层的循环
<ul class="org-ul">
<li>在死循环(<code>while true</code>)中使用break来控制循环</li>
</ul></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> 函数</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>函数有两种风格的写法，同时函数只有被调用才会执行</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">f_name</span> <span style="color: #AE81FF;">{</span>
    ...
    <span style="color: #F92672;">echo</span> $<span style="color: #FD971F;">result</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29992;&#20110;&#20316;&#20026;&#20989;&#25968;&#30340;&#36755;&#20986;&#20540;</span>
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">0</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29992;&#20110;&#36820;&#22238;&#20989;&#25968;&#36864;&#20986;&#29366;&#24577;&#30721;&#65292;&#33509;&#30465;&#30053;&#21017;&#36820;&#22238;&#26368;&#21518;&#19968;&#20010;&#21629;&#20196;&#30340;&#32467;&#26524;&#65292;&#33539;&#22260;&#26159;0-255</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #A6E22E;">f_name</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
    ...
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>函数的返回值
<ul class="org-ul">
<li>函数的输出值: 通过echo或print进行输出来作为函数输出值，可以通过使用命令引用来取得</li>
<li>函数退出状态码：通过return或最后一条命令的退出状态码，通过 <code>$?</code> 取得</li>
</ul></li>
<li>在函数中，可以像脚本传递参数那样使用其参数，因此不可使用外边脚本的特殊参数</li>
</ul>
</div>
</div>
