blog/2016-08-26-bash脚本编程.org
** 变量的类型与生效范围
- 本地变量: 生效范围为当前shell进程，对当前shell之外的其它shell进程，包括当前shell的子shell进程均无效
- 环境变量: 生效范围为当前shell进程及其子进程数
- 局部变量: 生效范围为当前shell进程中某代码片断(通常指函数)
- 位置变量: =$0=, =$1=, =$2=, ...来表示，用于让脚本在脚本代码中调用通过命令行传递给它的参数
- 特殊变量: =$?=, =$*=, =$@=, =$#=, =$$(UID)=, =$!(PID)=
** 本地与环境变量
*** 变量的赋值
#+BEGIN_SRC bash
# 本地变量
name="value: $val"  # 直接赋值字符串
name=`COMMAND`  # 命令引用
name=$(COMMAND)  # 命令引用
name=func()  # 引用函数输出

# 环境变量
export name=VALUE
declare -x name=VALUE
#+END_SRC

*** 变量的引用
- 变量引用方式: =$name=, =${name}=
- 字符串中的变量引用
  - 双引号: 弱引用，其中的变量引用会被替换为变量值
  - 单引号: 强引用，其中的变量引用不会被替换为变量值，而保持原字符串

*** 变量的查询
#+BEGIN_SRC bash
set  # 显示定义的所有变量
export  # 显示所有环境变量
env  # 显示所有环境变量
printenv   # 显示所有环境变量
#+END_SRC

*** 变量的删除
#+BEGIN_SRC bash
unset name  # 删除变量
#+END_SRC
  
** 局部变量
- 在函数中定义局部变量，函数结束的时候该变量会被销毁
- 如果局部变量名称本地变量相同，则本地变量在函数内会被隐藏
#+BEGIN_SRC bash
function f_name {
    local NAME=VALUE  # 该变量只在函数内生效
}
#+END_SRC
** 只读变量
- 只读变量不能被修改或销毁
- 只读变量可以声明为本地变量或环境变量，也可以将已有的变量转换为只读变量
#+BEGIN_SRC bash
readonly name
declare -r name
#+END_SRC

** 位置变量
- 在脚本代码中调用通过命令行传递给脚本的参数
  | $1, $2, ... | 对应调用的第n个参数                               |
  | $0          | 命令本身                                          |
  | $*          | 传递给脚本的所有参数(用IFS分隔符分割的一个字符串) |
  | $@          | 传递给脚本的所有参数(每个参数都是独立的列表)      |
  | $#          | 传递给脚本的参数的个数                            |

#+BEGIN_SRC bash
shift [n]  # 参数删除前面n个，会影响所有位置变量
#+END_SRC
* bash数组
** 引用数组
#+BEGIN_SRC bash
echo ${ARRAY_NAME[INDEX]}  # 若下标省略则引用下标为0的元素
echo ${ARRAY[@]} ${ARRAY[*]}  # 引用数组的所有元素
echo ${ARRAY[@]:offset:number}  # 跳过offset个元素后取出number个元素(number可以省略)
#+END_SRC
** 声明数组
#+BEGIN_SRC bash
declare -a ARRAY_NAME  # 普通数组，下标从0开始
declare -A ARRAY_NAME  # 关联数组，下标引可以自定义
#+END_SRC
** 数组元素的赋值
- 一次只赋值一个元素
  #+BEGIN_SRC bash
  ARRAY_NAME[INDEX]=VALUE
  #+END_SRC
- 一次赋值全部元素
  #+BEGIN_SRC bash
  ARRAY_NAME=("VAL1" "VAL2" ...)
  files=(/var/log/*.log)  # 通过glob来生成数组
  #+END_SRC
- 只赋值特定元素
  #+BEGIN_SRC bash
  ARRAY_NAME=([0]="VAL1" [3]="VAL2" ...)  # 创建稀疏格式数组
  ARRAY_NAME=([abc]="VAL1" [fdc]="VAL2" ...)  # 创建关联数组
  #+END_SRC
- 读取用户输入
  #+BEGIN_SRC bash
  read -a ARRAY
  #+END_SRC
- 追加元素
  #+BEGIN_SRC bash
  ARRAY[${#ARRAY[*]}]=VALUE  # 追加至数组末尾
  #+END_SRC
** 读取数组的长度
#+BEGIN_SRC bash
echo ${#ARRAY[*]}
echo ${#ARRAY[@]}
#+END_SRC

* bash字符串处理
** 子符串切片
| ${str:offset:number} | 跳过offset个字符后取出number个字符(可省略number) |
| ${str: -length}      | 取出右侧length个字符(注意空格)                   |
