_posts/2016-08-26-bash脚本编程.html

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">10</span> bash变量</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">变量的类型与生效范围</h3>
<div class="outline-text-3" id="text-orgheadline10">
<ul class="org-ul">
<li>本地变量: 生效范围为当前shell进程，对当前shell之外的其它shell进程，包括当前shell的子shell进程均无效</li>
<li>环境变量: 生效范围为当前shell进程及其子进程数</li>
<li>局部变量: 生效范围为当前shell进程中某代码片断(通常指函数)</li>
<li>位置变量: <code>$0</code>, <code>$1</code>, <code>$2</code>, &#x2026;来表示，用于让脚本在脚本代码中调用通过命令行传递给它的参数</li>
<li>特殊变量: <code>$?</code>, <code>$*</code>, <code>$@</code>, <code>$#</code>, <code>$$(UID)</code>, <code>$!(PID)</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">本地与环境变量</h3>
<div class="outline-text-3" id="text-orgheadline15">
</div><div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">变量的赋值</h4>
<div class="outline-text-4" id="text-orgheadline11">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#26412;&#22320;&#21464;&#37327;</span>
<span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"value: $val"</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#30452;&#25509;&#36171;&#20540;&#23383;&#31526;&#20018;</span>
<span style="color: #FD971F;">name</span>=<span style="color: #AE81FF; font-weight: bold;">`COMMAND`</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21629;&#20196;&#24341;&#29992;</span>
<span style="color: #FD971F;">name</span>=$<span style="color: #AE81FF;">(</span>COMMAND<span style="color: #AE81FF;">)</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21629;&#20196;&#24341;&#29992;</span>
<span style="color: #FD971F;">name</span>=func<span style="color: #AE81FF;">()</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#24341;&#29992;&#20989;&#25968;&#36755;&#20986;</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#29615;&#22659;&#21464;&#37327;</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">name</span>=VALUE
<span style="color: #F92672;">declare</span> -x <span style="color: #FD971F;">name</span>=VALUE
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">变量的引用</h4>
<div class="outline-text-4" id="text-orgheadline12">
<ul class="org-ul">
<li>变量引用方式: <code>$name</code>, <code>${name}</code></li>
<li>字符串中的变量引用
<ul class="org-ul">
<li>双引号: 弱引用，其中的变量引用会被替换为变量值</li>
<li>单引号: 强引用，其中的变量引用不会被替换为变量值，而保持原字符串</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13">变量的查询</h4>
<div class="outline-text-4" id="text-orgheadline13">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">set</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26174;&#31034;&#23450;&#20041;&#30340;&#25152;&#26377;&#21464;&#37327;</span>
<span style="color: #F92672;">export</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26174;&#31034;&#25152;&#26377;&#29615;&#22659;&#21464;&#37327;</span>
env  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26174;&#31034;&#25152;&#26377;&#29615;&#22659;&#21464;&#37327;</span>
printenv   <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26174;&#31034;&#25152;&#26377;&#29615;&#22659;&#21464;&#37327;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14">变量的删除</h4>
<div class="outline-text-4" id="text-orgheadline14">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">unset</span> name  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;&#21464;&#37327;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">局部变量</h3>
<div class="outline-text-3" id="text-orgheadline16">
<ul class="org-ul">
<li>在函数中定义局部变量，函数结束的时候该变量会被销毁</li>
<li>如果局部变量名称本地变量相同，则本地变量在函数内会被隐藏</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">f_name</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">local</span> <span style="color: #FD971F;">NAME</span>=VALUE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35813;&#21464;&#37327;&#21482;&#22312;&#20989;&#25968;&#20869;&#29983;&#25928;</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">只读变量</h3>
<div class="outline-text-3" id="text-orgheadline17">
<ul class="org-ul">
<li>只读变量不能被修改或销毁</li>
<li>只读变量可以声明为本地变量或环境变量，也可以将已有的变量转换为只读变量</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">readonly</span> name
<span style="color: #F92672;">declare</span> -r name
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">位置变量</h3>
<div class="outline-text-3" id="text-orgheadline18">
<ul class="org-ul">
<li><p>
在脚本代码中调用通过命令行传递给脚本的参数
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">$1, $2, &#x2026;</td>
<td class="org-left">对应调用的第n个参数</td>
</tr>

<tr>
<td class="org-left">$0</td>
<td class="org-left">命令本身</td>
</tr>

<tr>
<td class="org-left">$*</td>
<td class="org-left">传递给脚本的所有参数(用IFS分隔符分割的一个字符串)</td>
</tr>

<tr>
<td class="org-left">$@</td>
<td class="org-left">传递给脚本的所有参数(每个参数都是独立的列表)</td>
</tr>

<tr>
<td class="org-left">$#</td>
<td class="org-left">传递给脚本的参数的个数</td>
</tr>
</tbody>
</table></li>
</ul>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">shift</span> <span style="color: #AE81FF;">[</span>n<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21442;&#25968;&#21024;&#38500;&#21069;&#38754;n&#20010;&#65292;&#20250;&#24433;&#21709;&#25152;&#26377;&#20301;&#32622;&#21464;&#37327;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">11</span> bash数组</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">引用数组</h3>
<div class="outline-text-3" id="text-orgheadline20">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">ARRAY_NAME</span><span style="color: #66D9EF;">[</span>INDEX<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#33509;&#19979;&#26631;&#30465;&#30053;&#21017;&#24341;&#29992;&#19979;&#26631;&#20026;0&#30340;&#20803;&#32032;</span>
<span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">ARRAY</span><span style="color: #66D9EF;">[</span>@<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">ARRAY</span><span style="color: #66D9EF;">[</span>*<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#24341;&#29992;&#25968;&#32452;&#30340;&#25152;&#26377;&#20803;&#32032;</span>
<span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">ARRAY</span><span style="color: #66D9EF;">[</span>@<span style="color: #66D9EF;">]</span>:offset:number<span style="color: #AE81FF;">}</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36339;&#36807;offset&#20010;&#20803;&#32032;&#21518;&#21462;&#20986;number&#20010;&#20803;&#32032;(number&#21487;&#20197;&#30465;&#30053;)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">声明数组</h3>
<div class="outline-text-3" id="text-orgheadline21">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">declare</span> -a ARRAY_NAME  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26222;&#36890;&#25968;&#32452;&#65292;&#19979;&#26631;&#20174;0&#24320;&#22987;</span>
<span style="color: #F92672;">declare</span> -A ARRAY_NAME  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20851;&#32852;&#25968;&#32452;&#65292;&#19979;&#26631;&#24341;&#21487;&#20197;&#33258;&#23450;&#20041;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">数组元素的赋值</h3>
<div class="outline-text-3" id="text-orgheadline22">
<ul class="org-ul">
<li><p>
一次只赋值一个元素
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #FD971F;">ARRAY_NAME</span><span style="color: #AE81FF;">[</span>INDEX<span style="color: #AE81FF;">]</span>=VALUE
</pre>
</div></li>
<li><p>
一次赋值全部元素
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #FD971F;">ARRAY_NAME</span>=<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"VAL1"</span> <span style="color: #E6DB74;">"VAL2"</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">files</span>=<span style="color: #AE81FF;">(</span>/var/log/*.log<span style="color: #AE81FF;">)</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36890;&#36807;glob&#26469;&#29983;&#25104;&#25968;&#32452;</span>
</pre>
</div></li>
<li><p>
只赋值特定元素
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #FD971F;">ARRAY_NAME</span>=<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span>=<span style="color: #E6DB74;">"VAL1"</span> <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">]</span>=<span style="color: #E6DB74;">"VAL2"</span> ...<span style="color: #AE81FF;">)</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21019;&#24314;&#31232;&#30095;&#26684;&#24335;&#25968;&#32452;</span>
<span style="color: #FD971F;">ARRAY_NAME</span>=<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span>abc<span style="color: #66D9EF;">]</span>=<span style="color: #E6DB74;">"VAL1"</span> <span style="color: #66D9EF;">[</span>fdc<span style="color: #66D9EF;">]</span>=<span style="color: #E6DB74;">"VAL2"</span> ...<span style="color: #AE81FF;">)</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21019;&#24314;&#20851;&#32852;&#25968;&#32452;</span>
</pre>
</div></li>
<li><p>
读取用户输入
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">read</span> -a ARRAY
</pre>
</div></li>
<li><p>
追加元素
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #FD971F;">ARRAY</span><span style="color: #AE81FF;">[</span>$<span style="color: #66D9EF;">{</span>#<span style="color: #FD971F;">ARRAY</span><span style="color: #A6E22E;">[</span>*<span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">]</span>=VALUE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36861;&#21152;&#33267;&#25968;&#32452;&#26411;&#23614;</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">读取数组的长度</h3>
<div class="outline-text-3" id="text-orgheadline23">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span>#<span style="color: #FD971F;">ARRAY</span><span style="color: #66D9EF;">[</span>*<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>
<span style="color: #F92672;">echo</span> $<span style="color: #AE81FF;">{</span>#<span style="color: #FD971F;">ARRAY</span><span style="color: #66D9EF;">[</span>@<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">12</span> bash字符串处理</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25">子符串切片</h3>
<div class="outline-text-3" id="text-orgheadline25">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">${str:offset:number}</td>
<td class="org-left">跳过offset个字符后取出number个字符(可省略number)</td>
</tr>

<tr>
<td class="org-left">${str: -length}</td>
<td class="org-left">取出右侧length个字符(注意空格)</td>
</tr>
</tbody>
</table>
</div>
</div>
