blog/2016-08-26-bash脚本编程.org
** 基于glob取子串
| ${str#glob}  | 自左向右的删除glob的第一次最短匹配 |
| ${str##glob} | 自左向右的删除glob的第一次最长匹配 |
| ${str%glob}  | 自右向左的删除glob的第一次最短匹配 |
| ${str%%glob} | 自右向左的删除glob的第一次最长匹配 |


#+BEGIN_SRC bash
str=${str##*word}  # 删除字符串开头到最后一次word匹配的字符
str=${str%%word*}  # 删除第一次word匹配到字符串末尾
#+END_SRC
** 查找替换(最长匹配)
| ${str/glob/substr}  | 用substr替换第一次被glob匹配到的字符串(/substr省略则为删除) |
| ${str//glob/substr} | 用substr替换所有能被glob匹配到的字符串(/substr省略则为删除) |
| ${str/#glob/substr} | 用substr替换行首被glob匹配到的字符串(/substr省略则为删除)   |
| ${str/%glob/substr} | 用substr替换行尾被glob匹配到的字符串(/substr省略则为删除)   |
** 大小写转换
| ${var^^} | 把var中的所有小写字母转换为大写 |
| ${var,,} | 把var中的所有大写字母转换为小写 |
** 变量赋值
| ${var-value}      | 如果var未设置，那么返回value；否则，则返回var的值                     |
| ${var=value}      | 如果var未设置，那么返回value，并将value赋值给var；否则，则返回var的值 |
| ${var+value}      | 如果var已设置，则返回value                                            |
| ${var?error_info} | 如果var未设置，那么输出错误error_info；否则，则返回var的值            |
- 若在 =-=+?= 前加上冒号 =:= ，那么空变量会视为未设置，默认空变量被视为已设置

* bash中的算术计算
** 计算命令
#+BEGIN_SRC bash
declare -i name=NUM  # 定义name为整形数据, 则后边的赋值计算中的let可以省略
let var=EXPRESSION
var=$[EXPRESSION]
var=$((EXPRESSION))
var=$(expr arg1 arg2 arg3)  # 某些符号需要进行转义
#+END_SRC
- bash有内建的随机数生成器: $RANDOM
** 运算符号
- 基本运算符号: =+= , =-= , =*= , =/= , =%= , =**=
- 增强型赋值: =+== , =-== , =*== , =/== , =%==
- 自增与自减: =var++= , =var--=
* bash的条件测试
** 测试命令
用于测试表达式的结果
#+BEGIN_SRC bash
test EXPRESSION
[ EXPRESSION ]  # EXPRESSION前后必须有空白字符
[[ EXPRESSION ]]
#+END_SRC
** 测试符号
*** 数值测试
| -gt | greater than  |
| -ge | greater equal |
| -eq | equal         |
| -ne | not equal     |
| -lt | less than     |
| -le | less equal    |
*** 字符串测试 
| ==          | 等于                                                                  |
| >           | 大于                                                                  |
| <           | 小于                                                                  |
| !=          | 不等于                                                                |
| =~          | 左侧字符串是否能够被右侧的PATTERN(不需要用引号)部分匹配，用于双括号中 |
| -z "STRING" | 测试字符串是否为空，空则为真，不空则为假                              |
| -n "STRING" | 测试字符串是否不空，不空则为真，空则为假                              |
- 注意: 用于字符串比较时的用到的操作数都应该使用引号
*** 文件测试
- 存在性测试
  | -e FILE | 文件存在性测试，存在为真，否则为假 |
  | -b FILE | 是否存在且为块设备文件             |
  | -c FILE | 是否存在且为字符设备文件           |
  | -d FILE | 是否存在且为目录文件               |
  | -f FILE | 是否存在且为普通文件               |
  | -p FILE | 是否存在且为命名管道文件           |
  | -L FILE | 是否存在且为符号链接文件           |
  | -S FILE | 是否存在且为套接字文件             |
- 文件权限测试(不适用于root)
  | -r FILE | 是否存在且可读             |
  | -w FILE | 是否存在且可写             |
  | -x FILE | 是否存在且可执行           |
  | -O FILE | 当前有效用户是否为文件属主 |
  | -G FILE | 当前有效用户是否为文件属组 |
- 文件特殊权限测试
  | -g FILE | 是否存在且拥有sgid权限   |
  | -u FILE | 是否存在且拥有suid权限   |
  | -k FILE | 是否存在且拥有sticky权限 |
- 文件其他测试
  | -s FILE | 是否存且非空                           |
  | -t fd   | 文件描述符fd是否已经打开且与某终端相关 |
  | -N FILE | 文件自动上一次被读取之后是否被修改过   |
- 双目测试
  | FILE1 -ef FILE2 | FILE1与FILE2是否指向同一个设备上的相同inode |
  | FILE1 -nt FILE2 | FILE1是否新于FILE2                          |
  | FILE1 -ot FILE2 | FILE1是否旧于FILE2                          |
** 组合条件
- 命令组合 ::
  - =COMMAND && COMMAND=: 第一个命令结果为false的话，则不会运行下一个
  - =COMMAND || COMMAND=: 第一个命令结果为true的话，则不会运行下一个
  - =! COMMAND=: 将后边所接的命令结果取反
- 条件组合 ::
  - =EXPRESSION -a EXPRESSION=: 与
  - =EXPRESSION -o EXPRESSION=: 或
  - =! \(EXPRESSION\)=: 非

