_posts/2016-08-26-bash脚本编程.html
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26">基于glob取子串</h3>
<div class="outline-text-3" id="text-orgheadline26">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">${str#glob}</td>
<td class="org-left">自左向右的删除glob的第一次最短匹配</td>
</tr>

<tr>
<td class="org-left">${str##glob}</td>
<td class="org-left">自左向右的删除glob的第一次最长匹配</td>
</tr>

<tr>
<td class="org-left">${str%glob}</td>
<td class="org-left">自右向左的删除glob的第一次最短匹配</td>
</tr>

<tr>
<td class="org-left">${str%%glob}</td>
<td class="org-left">自右向左的删除glob的第一次最长匹配</td>
</tr>
</tbody>
</table>


<div class="org-src-container">

<pre class="src src-bash"><span style="color: #FD971F;">str</span>=$<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">str</span>##*word<span style="color: #AE81FF;">}</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;&#23383;&#31526;&#20018;&#24320;&#22836;&#21040;&#26368;&#21518;&#19968;&#27425;word&#21305;&#37197;&#30340;&#23383;&#31526;</span>
<span style="color: #FD971F;">str</span>=$<span style="color: #AE81FF;">{</span><span style="color: #FD971F;">str</span>%%word*<span style="color: #AE81FF;">}</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;&#31532;&#19968;&#27425;word&#21305;&#37197;&#21040;&#23383;&#31526;&#20018;&#26411;&#23614;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27">查找替换(最长匹配)</h3>
<div class="outline-text-3" id="text-orgheadline27">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">${str/glob/substr}</td>
<td class="org-left">用substr替换第一次被glob匹配到的字符串(/substr省略则为删除)</td>
</tr>

<tr>
<td class="org-left">${str//glob/substr}</td>
<td class="org-left">用substr替换所有能被glob匹配到的字符串(/substr省略则为删除)</td>
</tr>

<tr>
<td class="org-left">${str/#glob/substr}</td>
<td class="org-left">用substr替换行首被glob匹配到的字符串(/substr省略则为删除)</td>
</tr>

<tr>
<td class="org-left">${str/%glob/substr}</td>
<td class="org-left">用substr替换行尾被glob匹配到的字符串(/substr省略则为删除)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">大小写转换</h3>
<div class="outline-text-3" id="text-orgheadline28">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">${var^^}</td>
<td class="org-left">把var中的所有小写字母转换为大写</td>
</tr>

<tr>
<td class="org-left">${var,,}</td>
<td class="org-left">把var中的所有大写字母转换为小写</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">变量赋值</h3>
<div class="outline-text-3" id="text-orgheadline29">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">${var-value}</td>
<td class="org-left">如果var未设置，那么返回value；否则，则返回var的值</td>
</tr>

<tr>
<td class="org-left">${var=value}</td>
<td class="org-left">如果var未设置，那么返回value，并将value赋值给var；否则，则返回var的值</td>
</tr>

<tr>
<td class="org-left">${var+value}</td>
<td class="org-left">如果var已设置，则返回value</td>
</tr>

<tr>
<td class="org-left">${var?error_info}</td>
<td class="org-left">如果var未设置，那么输出错误error_info；否则，则返回var的值</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>若在 <code>-=+?</code> 前加上冒号 <code>:</code> ，那么空变量会视为未设置，默认空变量被视为已设置</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">13</span> bash中的算术计算</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">计算命令</h3>
<div class="outline-text-3" id="text-orgheadline31">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">declare</span> -i <span style="color: #FD971F;">name</span>=NUM  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23450;&#20041;name&#20026;&#25972;&#24418;&#25968;&#25454;, &#21017;&#21518;&#36793;&#30340;&#36171;&#20540;&#35745;&#31639;&#20013;&#30340;let&#21487;&#20197;&#30465;&#30053;</span>
<span style="color: #F92672;">let</span> <span style="color: #FD971F;">var</span>=EXPRESSION
<span style="color: #FD971F;">var</span>=$<span style="color: #AE81FF;">[</span>EXPRESSION<span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">var</span>=$<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>EXPRESSION<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">var</span>=$<span style="color: #AE81FF;">(</span>expr arg1 arg2 arg3<span style="color: #AE81FF;">)</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26576;&#20123;&#31526;&#21495;&#38656;&#35201;&#36827;&#34892;&#36716;&#20041;</span>
</pre>
</div>
<ul class="org-ul">
<li>bash有内建的随机数生成器: $RANDOM</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32">运算符号</h3>
<div class="outline-text-3" id="text-orgheadline32">
<ul class="org-ul">
<li>基本运算符号: <code>+</code> , <code>-</code> , <code>*</code> , <code>/</code> , <code>%</code> , <code>**</code></li>
<li>增强型赋值: <code>+=</code> , <code>-=</code> , <code>*=</code> , <code>/=</code> , <code>%=</code></li>
<li>自增与自减: <code>var++</code> , <code>var--</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-2">
<h2 id="orgheadline40"><span class="section-number-2">14</span> bash的条件测试</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34">测试命令</h3>
<div class="outline-text-3" id="text-orgheadline34">
<p>
用于测试表达式的结果
</p>
<div class="org-src-container">

<pre class="src src-bash">test EXPRESSION
<span style="color: #AE81FF;">[</span> EXPRESSION <span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">EXPRESSION&#21069;&#21518;&#24517;&#39035;&#26377;&#31354;&#30333;&#23383;&#31526;</span>
<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">[</span> EXPRESSION <span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38">测试符号</h3>
<div class="outline-text-3" id="text-orgheadline38">
</div><div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35">数值测试</h4>
<div class="outline-text-4" id="text-orgheadline35">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-gt</td>
<td class="org-left">greater than</td>
</tr>

<tr>
<td class="org-left">-ge</td>
<td class="org-left">greater equal</td>
</tr>

<tr>
<td class="org-left">-eq</td>
<td class="org-left">equal</td>
</tr>

<tr>
<td class="org-left">-ne</td>
<td class="org-left">not equal</td>
</tr>

<tr>
<td class="org-left">-lt</td>
<td class="org-left">less than</td>
</tr>

<tr>
<td class="org-left">-le</td>
<td class="org-left">less equal</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36">字符串测试</h4>
<div class="outline-text-4" id="text-orgheadline36">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">==</td>
<td class="org-left">等于</td>
</tr>

<tr>
<td class="org-left">&gt;</td>
<td class="org-left">大于</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">小于</td>
</tr>

<tr>
<td class="org-left">!=</td>
<td class="org-left">不等于</td>
</tr>

<tr>
<td class="org-left">=~</td>
<td class="org-left">左侧字符串是否能够被右侧的PATTERN(不需要用引号)部分匹配，用于双括号中</td>
</tr>

<tr>
<td class="org-left">-z "STRING"</td>
<td class="org-left">测试字符串是否为空，空则为真，不空则为假</td>
</tr>

<tr>
<td class="org-left">-n "STRING"</td>
<td class="org-left">测试字符串是否不空，不空则为真，空则为假</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>注意: 用于字符串比较时的用到的操作数都应该使用引号</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37">文件测试</h4>
<div class="outline-text-4" id="text-orgheadline37">
<ul class="org-ul">
<li><p>
存在性测试
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-e FILE</td>
<td class="org-left">文件存在性测试，存在为真，否则为假</td>
</tr>

<tr>
<td class="org-left">-b FILE</td>
<td class="org-left">是否存在且为块设备文件</td>
</tr>

<tr>
<td class="org-left">-c FILE</td>
<td class="org-left">是否存在且为字符设备文件</td>
</tr>

<tr>
<td class="org-left">-d FILE</td>
<td class="org-left">是否存在且为目录文件</td>
</tr>

<tr>
<td class="org-left">-f FILE</td>
<td class="org-left">是否存在且为普通文件</td>
</tr>

<tr>
<td class="org-left">-p FILE</td>
<td class="org-left">是否存在且为命名管道文件</td>
</tr>

<tr>
<td class="org-left">-L FILE</td>
<td class="org-left">是否存在且为符号链接文件</td>
</tr>

<tr>
<td class="org-left">-S FILE</td>
<td class="org-left">是否存在且为套接字文件</td>
</tr>
</tbody>
</table></li>
<li><p>
文件权限测试(不适用于root)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-r FILE</td>
<td class="org-left">是否存在且可读</td>
</tr>

<tr>
<td class="org-left">-w FILE</td>
<td class="org-left">是否存在且可写</td>
</tr>

<tr>
<td class="org-left">-x FILE</td>
<td class="org-left">是否存在且可执行</td>
</tr>

<tr>
<td class="org-left">-O FILE</td>
<td class="org-left">当前有效用户是否为文件属主</td>
</tr>

<tr>
<td class="org-left">-G FILE</td>
<td class="org-left">当前有效用户是否为文件属组</td>
</tr>
</tbody>
</table></li>
<li><p>
文件特殊权限测试
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-g FILE</td>
<td class="org-left">是否存在且拥有sgid权限</td>
</tr>

<tr>
<td class="org-left">-u FILE</td>
<td class="org-left">是否存在且拥有suid权限</td>
</tr>

<tr>
<td class="org-left">-k FILE</td>
<td class="org-left">是否存在且拥有sticky权限</td>
</tr>
</tbody>
</table></li>
<li><p>
文件其他测试
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-s FILE</td>
<td class="org-left">是否存且非空</td>
</tr>

<tr>
<td class="org-left">-t fd</td>
<td class="org-left">文件描述符fd是否已经打开且与某终端相关</td>
</tr>

<tr>
<td class="org-left">-N FILE</td>
<td class="org-left">文件自动上一次被读取之后是否被修改过</td>
</tr>
</tbody>
</table></li>
<li><p>
双目测试
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">FILE1 -ef FILE2</td>
<td class="org-left">FILE1与FILE2是否指向同一个设备上的相同inode</td>
</tr>

<tr>
<td class="org-left">FILE1 -nt FILE2</td>
<td class="org-left">FILE1是否新于FILE2</td>
</tr>

<tr>
<td class="org-left">FILE1 -ot FILE2</td>
<td class="org-left">FILE1是否旧于FILE2</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39">组合条件</h3>
<div class="outline-text-3" id="text-orgheadline39">
<dl class="org-dl">
<dt>命令组合</dt><dd><ul class="org-ul">
<li><code>COMMAND &amp;&amp; COMMAND</code>: 第一个命令结果为false的话，则不会运行下一个</li>
<li><code>COMMAND || COMMAND</code>: 第一个命令结果为true的话，则不会运行下一个</li>
<li><code>! COMMAND</code>: 将后边所接的命令结果取反</li>
</ul></dd>
<dt>条件组合</dt><dd><ul class="org-ul">
<li><code>EXPRESSION -a EXPRESSION</code>: 与</li>
<li><code>EXPRESSION -o EXPRESSION</code>: 或</li>
<li><code>! \(EXPRESSION\)</code>: 非</li>
</ul></dd>
</dl>
</div>
</div>
</div>
