_posts/2016-08-26-bash脚本编程.html

<div id="outline-container-orgheadline41" class="outline-2">
<h2 id="orgheadline41"><span class="section-number-2">15</span> bash输出的字体颜色</h2>
<div class="outline-text-2" id="text-15">
<dl class="org-dl">
<dt>字体颜色</dt><dd><div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[30m &#40657;&#33394;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[31m &#32418;&#33394;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[32m &#32511;&#33394;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[33m &#40644;&#33394;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[34m &#34013;&#33394;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[35m &#32043;&#33394;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[36m &#22825;&#34013;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[37m &#30333;&#33394;&#23383; \033[0m"</span>
</pre>
</div></dd>
<dt>字体背景色</dt><dd><div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[40;37m &#40657;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[41;37m &#32418;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[42;37m &#32511;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[43;37m &#40644;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[44;37m &#34013;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[45;37m &#32043;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[46;37m &#22825;&#34013;&#24213;&#30333;&#23383; \033[0m"</span> 
<span style="color: #F92672;">echo</span> -e <span style="color: #E6DB74;">"\033[47;30m &#30333;&#24213;&#40657;&#23383; \033[0m"</span>
</pre>
</div></dd>
</dl>
</div>
</div>
